Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/properties-omegat.tmx
Source language: en_us
Languages: pt_br

source: Creates a resource bundle (.properties) file suitable for internationalizing applications by separating out all human-visible text strings from your code.
pt_br: Cria um pacote de recursos de arquivos (.properties) adequados para internacionalização das aplicações, separando da visibilidade humana os textos, do seu código.

source: Resource bundle files can also be used to collect other types of strings, such as properties for Ant scripts.
pt_br: Arquivos do pacote de recursos podem ser utilizados também para coletar outros tipos de strings, como por exemplo, propriedades para scripts Ant.

source: The created resource bundle contains only one locale, but you can add additional locales from the created file's contextual menu.
pt_br: O pacote de recursos criado contém apenas uma localidade, mas você pode adicionar novas localidades no menu de arquivos criados.

source: The bundle can be edited in a text file (property-file format) for a specific locale or in a table that displays information for all locales.
pt_br: O pacote pode ser editado em um arquivo texto (property-file format) para um local específico ou em uma tabela que mostra informações de todos os locais.

source: This panel allows you to edit bundles.
pt_br: Este painel permite a edição de pacotes

source: &Auto Resize
pt_br: Redimensionar &automaticamente

source: New Property
pt_br: Nova propriedade

source: &New Property...
pt_br: &Nova propriedade...

source: &Comment:
pt_br: &Comentário:

source: &Key:
pt_br: Chave:

source: &Remove Property
pt_br: &Remover propriedade

source: &Value:
pt_br: &Valor:

source: Really delete property {0} ?
pt_br: Realmente excluir a propriedade {0}?

source: This table shows keys and values
pt_br: Esta tabela mostra chaves e valores

source: Cell Editor
pt_br: Editor de células

source: Type the value here
pt_br: Digite o valor aqui

source: Type the comments here
pt_br: Digite os comentários aqui

source: This panel allows you to add new keys, values and comments.
pt_br: Este painel permite adicionar novas chaves, valores e comentários.

source: &Locales:
pt_br: Localidades:

source: &Add Locale
pt_br: &Adicionar localidade

source: &Remove Locale
pt_br: &Remover localidade

source: List of locales in this bundle.
pt_br: Lista de localidades deste pacote.

source: name of the property resource bundle
pt_br: nome do pacote de recursos de propriedades

source: Remove Locale
pt_br: Remover localidade

source: Are you sure you want to remove selected locales?
pt_br: Tem certeza que deseja remover as localidades selecionadas?

source: This dialog allows you to add and remove locales from this bundle.
pt_br: Este diálogo permite que você adicione e remova localidades para este pacote

source: Name of this object.
pt_br: Nome deste objeto.

source: Determines if this object is a template (can make instances of itself).
pt_br: Determina se este objeto é um modelo (pode criar instâncias de si mesmo).

source: Name
pt_br: Nome

source: Template
pt_br: Modelo

source: This dialog allows you to search by criteria in bundles.
pt_br: Este diálogo permite que você pesquise por critérios em pacotes

source: &Backward Search
pt_br: &Pesquisa para trás

source: Cancel
pt_br: Cancelar

source: Find
pt_br: Localizar

source: &Highlight Search
pt_br: Realce da pesquisa

source: Match &Case
pt_br: Coincidir &maiúsculas e minúsculas

source: &Search by Rows
pt_br: &Pesquisa por linhas

source: W&rap Search
pt_br: Pesquisa ci&rcular

source: Find &What:
pt_br: Localizar:

source: Comment above this property.
pt_br: Comente em cima desta propriedade.

source: Key used by source code to access this property.
pt_br: Chave usada pelo código para acessar essa propriedade.

source: Localized value of this property.
pt_br: Valor localizado desta propriedade.

source: The key could not be renamed.
pt_br: A chave não pode ser renomeada.

source: Another key with this name already exists.
pt_br: Outra chave com este nome já existe.

source: Comment
pt_br: Comentário

source: Key
pt_br: Chave

source: K
pt_br: H

source: Value
pt_br: Valor

source: &Name:
pt_br: &Nome:

source: &Keys:
pt_br: C&haves:

source: &Add Key
pt_br: &Adicionar chave

source: &Remove Key
pt_br: &Remover chave

source: This dialog allows you to add and remove keys from this bundle.
pt_br: Este diálogo permite adicionar e remover chaves deste pacote.

source: &Country Code:
pt_br: &Código do país

source: &Language Code:
pt_br: Código do &idioma:

source: L&ocale:
pt_br: L&ocalização:

source: New File:
pt_br: Novo arquivo:

source: &Predefined Locales:
pt_br: Localizações &pré-definidas

source: &Variant:
pt_br: &Variação:

source: This dialog allows you to choose a locale.
pt_br: Este diálogo permite escolher uma localidade.

source: Resource Bundles
pt_br: Pacotes de recursos

source: Data Files
pt_br: Arquivos de dados

source: Supports editing of .properties files.
pt_br: Suporta a edição de arquivos .properties.

source: The Resource Bundles module provides support for browsing .properties files in the Explorer and editing them in the Source Editor or in a table view.
pt_br: O módulo de Pacotes de Recursos provê suporte para navegação em arquivos .properties no Explorer e para sua edição no editor de código-fonte ou em uma visão tabular.

source: List of extensions and MIME content types.
pt_br: Lista de extensões e tipos de conteúdo MIME.

source: File Extensions
pt_br: Extensões de arquivos

source: Properties Objects
pt_br: Objetos de propriedades

source: Resource Bundle Files
pt_br: Pacote de recursos

source: New Locale
pt_br: Nova localidade

source: Locale...
pt_br: Localidade...

source: Language {0} already exists in this bundle.
pt_br: Idioma {0} já existe para este pacote.

source: Opening {0} ...
pt_br: Abrindo {0} ...

source: File {0} is modified.
pt_br: Arquivo {0} está modificado.

source: Save it ?
pt_br: Salva-lo ?

source: Rename
pt_br: Renomear

source: &New Name:
pt_br: &Novo nome:

source: This entry cannot be renamed.
pt_br: Esta entrada não pode ser renomeada.

source: Paste without value
pt_br: Colar sem valor

source: Paste with value
pt_br: Colar com valor

source: Property...
pt_br: Propriedade...

source: Property {0} already exists in {1} locale.
pt_br: Propriedade {0} já existe na localidade {1}.

source: default language
pt_br: idioma padrão

source: ({0} - unknown language)
pt_br: ({0} - idioma desconhecido)

source: {0} - unknown country
pt_br: {0} - país desconhecido

source: Properties File
pt_br: Arquivo de propriedades

source: Save
pt_br: Salvar

source: &Discard
pt_br: &Descartar

source: Question
pt_br: Pergunta

source: Resource Bundle Syntax Coloring
pt_br: Realce de sintaxe para pacote de recursos

source: Editing
pt_br: Edição

source: Syntax coloring for .properties files in the source editor.
pt_br: Realce de sintaxe para arquivos .properties no editor de código-fonte.

source: The Resource Bundle Syntax Coloring module provides syntax coloring in the source editor for .properties files.
pt_br: O pacote de recursos para realce de sintaxe, provê realce de sintaxe para arquivos .properties no editor de código-fonte.

source: Properties Editor
pt_br: Editor de propriedades

source: Shadow Table Cell
pt_br: Sombrear célula de tabela

source: Shadows table cell for value if the key does not exist in that .properties file.
pt_br: Sombrear célula de tabela se a chave não existe naquele arquivo .properties.

source: Properties
pt_br: Propriedades

source: Whitespace
pt_br: Espaço em branco

source: Equal sign
pt_br: Sinal de igualdade
